app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE (created_at <= '2017-10-24 17:10:05.768385') ORDER BY created_at desc
---
	def index
		@recipes = Recipe.all

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "stuff" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["stuff", "Frango e creme de leite"], ["updated_at", "2017-10-23 19:54:48.802634"], ["id", 1]]
---
	def update
		@recipe=Recipe.find(params[:id])
		recipe_params = params.require(:recipe).permit(:nome, :stuff, :calories, :Prepare_mode, :cost)
		@recipe.update(recipe_params)

INSERT INTO "recipes" ("nome", "stuff", "calories", "created_at", "updated_at", "Prepare_mode", "cost") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		recipe_params = params.require(:recipe).permit(:nome, :stuff, :calories, :Prepare_mode, :cost)
		@recipe = Recipe.new(recipe_params)
		@recipe.save